tests/staf-tests/functional-tests/shared/data/dsml/suites/09modDNsuite/data/moddn030.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 505
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
  <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
     <modDNRequest dn="ou=MyPeople2, ou=Groups, o=dsmlfe.com" newrdn="ou=People" newSuperior="o=dsmlfe.com" deleteoldrdn="false" />
  </batchRequest>
  </soap-env:Body>
  </soap-env:Envelope>
